# Data Cleaning and Preparation

# 7.1 Handling Missing Data.

In [1]:
import pandas as pd
import numpy as np

In [22]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [23]:
s1 = pd.Series([None])
s2 = pd.concat([string_data, s1])

In [24]:
s2

0     aardvark
1    artichoke
2          NaN
3      avocado
0         None
dtype: object

In [25]:
type(s2)

pandas.core.series.Series

In [26]:
s2.isnull()

0    False
1    False
2     True
3    False
0     True
dtype: bool

# Filtering out missing data:

In [27]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [28]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [30]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [32]:
data = pd.DataFrame([
    [1,6,5,3.],
    [1,NA,NA],
    [NA,NA,NA],
    [NA,6.5,3]
])
data

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [34]:
cleaned = data.dropna(how='all')
cleaned

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [35]:
data[4] = NA

In [36]:
data

     0    1    2    3   4
0  1.0  6.0  5.0  3.0 NaN
1  1.0  NaN  NaN  NaN NaN
2  NaN  NaN  NaN  NaN NaN
3  NaN  6.5  3.0  NaN NaN

In [37]:
data.dropna(axis=1, how='all')

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [39]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.725810  0.766501  0.310638
1 -0.239889  0.351687  0.478007
2 -0.438432  0.367812 -1.002714
3  0.055252 -0.272082  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [40]:
df.iloc[:4,1]= NA

In [42]:
df.iloc[:2,2] = NA

In [43]:
df

          0         1         2
0  1.725810       NaN       NaN
1 -0.239889       NaN       NaN
2 -0.438432       NaN -1.002714
3  0.055252       NaN  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [44]:
df.dropna()

          0         1         2
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [45]:
df.dropna(thresh=2)

          0         1         2
2 -0.438432       NaN -1.002714
3  0.055252       NaN  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

# Filling in Missing Data

In [46]:
df

          0         1         2
0  1.725810       NaN       NaN
1 -0.239889       NaN       NaN
2 -0.438432       NaN -1.002714
3  0.055252       NaN  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [47]:
df.fillna(0)

          0         1         2
0  1.725810  0.000000  0.000000
1 -0.239889  0.000000  0.000000
2 -0.438432  0.000000 -1.002714
3  0.055252  0.000000  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [48]:
df.fillna({1:0.5, 2:22})

          0         1          2
0  1.725810  0.500000  22.000000
1 -0.239889  0.500000  22.000000
2 -0.438432  0.500000  -1.002714
3  0.055252  0.500000   0.807073
4 -1.301827  1.184065   0.727327
5 -1.367738  1.198419   0.258431
6 -0.477807 -0.605250   1.316633

In [52]:
a = df.fillna(0, inplace=True)

In [53]:
df

          0         1         2
0  1.725810  0.000000  0.000000
1 -0.239889  0.000000  0.000000
2 -0.438432  0.000000 -1.002714
3  0.055252  0.000000  0.807073
4 -1.301827  1.184065  0.727327
5 -1.367738  1.198419  0.258431
6 -0.477807 -0.605250  1.316633

In [55]:
print(a)

None

In [56]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.854669  0.954529  0.585362
1  1.301801  0.022586  2.949496
2 -0.386537       NaN -1.884663
3  0.803706       NaN  0.705416
4  0.869107       NaN       NaN
5  0.084765       NaN       NaN

In [57]:
df.fillna(method='ffill')

          0         1         2
0 -0.854669  0.954529  0.585362
1  1.301801  0.022586  2.949496
2 -0.386537  0.022586 -1.884663
3  0.803706  0.022586  0.705416
4  0.869107  0.022586  0.705416
5  0.084765  0.022586  0.705416

In [58]:
df

          0         1         2
0 -0.854669  0.954529  0.585362
1  1.301801  0.022586  2.949496
2 -0.386537       NaN -1.884663
3  0.803706       NaN  0.705416
4  0.869107       NaN       NaN
5  0.084765       NaN       NaN

In [59]:
df.fillna(method='ffill', limit=2
         )

          0         1         2
0 -0.854669  0.954529  0.585362
1  1.301801  0.022586  2.949496
2 -0.386537  0.022586 -1.884663
3  0.803706  0.022586  0.705416
4  0.869107       NaN  0.705416
5  0.084765       NaN  0.705416

In [60]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [61]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation PG - 215

In [2]:

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [5]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [8]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [9]:
data['v1'] = np.arange(7)

In [10]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [11]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [12]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [13]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

## Transforming Data Using a Function or Mapping.

In [14]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [15]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [16]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [17]:
data['animal'] = lowercased.map(meat_to_animal)

In [18]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [19]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Value:

In [20]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [21]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [25]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [26]:
data.replace({-999:np.nan, -1000:0.0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming axis indexes

In [28]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 ....: index=['Ohio', 'Colorado', 'New York'],
 ....: columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [29]:
transform = lambda x: x[:4].upper()

In [30]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [32]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [33]:
data.index = data.index.map(transform)

In [34]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [35]:
data.index

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [37]:
data.rename(index=str.title, columns=str.upper
           )

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [38]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'}, inplace=True)

In [44]:
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

# Discretization and Binning

In [45]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [46]:
bins = [18,25,35,60,100]

In [47]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [49]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [50]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [51]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [52]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [54]:
pd.cut(ages, bins, labels=group_names, right=False)

['Youth', 'Youth', 'YoungAdult', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [55]:
data = np.random.rand(20)
data

array([0.10382226, 0.28444256, 0.59534687, 0.29929314, 0.50067181,
       0.02082242, 0.95435169, 0.76502415, 0.39904186, 0.95520376,
       0.30018644, 0.89357389, 0.45103694, 0.57959311, 0.5450079 ,
       0.58082971, 0.12101726, 0.3405455 , 0.68422611, 0.19223021])

In [56]:
pd.cut(data, 4, precision=2)

[(0.02, 0.25], (0.25, 0.49], (0.49, 0.72], (0.25, 0.49], (0.49, 0.72], ..., (0.49, 0.72], (0.02, 0.25], (0.25, 0.49], (0.49, 0.72], (0.02, 0.25]]
Length: 20
Categories (4, interval[float64, right]): [(0.02, 0.25] < (0.25, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

In [58]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.0525, 0.747], (0.747, 4.341], (-3.017, -0.65], (0.747, 4.341], (-3.017, -0.65], ..., (0.747, 4.341], (0.0525, 0.747], (-0.65, 0.0525], (0.747, 4.341], (-3.017, -0.65]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.017, -0.65] < (-0.65, 0.0525] < (0.0525, 0.747] < (0.747, 4.341]]

In [60]:
pd.value_counts(cats)

(-3.017, -0.65]    250
(-0.65, 0.0525]    250
(0.0525, 0.747]    250
(0.747, 4.341]     250
dtype: int64

In [61]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0525, 1.259], (0.0525, 1.259], (-3.017, -1.251], (0.0525, 1.259], (-1.251, 0.0525], ..., (1.259, 4.341], (0.0525, 1.259], (-1.251, 0.0525], (1.259, 4.341], (-3.017, -1.251]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.017, -1.251] < (-1.251, 0.0525] < (0.0525, 1.259] < (1.259, 4.341]]

# Detecting and Filtering Outliers

In [63]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005352    -0.050639    -0.017270    -0.019105
std       0.962972     1.007343     0.983983     0.989101
min      -3.675118    -3.519875    -2.951595    -3.343384
25%      -0.620178    -0.742355    -0.714720    -0.657933
50%      -0.006978    -0.095179    -0.045312    -0.068871
75%       0.628186     0.612005     0.633627     0.668067
max       3.097841     3.175575     3.877042     3.509714

In [ ]:
223